tutorials/combustion/fireFoam/les/compartmentFire/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     fireFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         350;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1.2;

maxDi           0.25;

maxDeltaT       0.01;

functions
{
    patchInlet_phi
    {
        type                surfaceFieldValue;
        functionObjectLibs  ("libfieldFunctionObjects.so");
        enabled             true;
        writeControl        timeStep;
        writeInterval       20;
        log                 true;
        writeFields         no;
        regionType          patch;
        name                inlet;
        operation           sum;
        fields              (phi);
    }

    wallPanel_Qin
    {
        type                patchProbes;
        functionObjectLibs  ("libsampling.so");
        enabled             true;
        writeControl        outputTime;
        writeInterval       20;
        log                 true;
        patchName           region0_to_panelRegion_wallPanel;
        probeLocations
        (
            ( 0.15 0.0 0.01 ) //HF2
            ( 0.2 0.2 0.01 )  //HF3
            ( 0.0 0.4 0.01 )  //HF4
        );
        fields              (Qin);
    }

    inletQr_Qin
    {
        type                patchProbes;
        functionObjectLibs ("libsampling.so");
        enabled            true;
        writeControl       outputTime;
        writeInterval      20;
        log                true;
        patchName          inlet;
        probeLocations
        (
            ( 0.0 0.0 0.0 )     //HF1
            ( 0.02 0.0 0.02 )   //HF2
            ( 0.02 0.0 -0.02 )  //HF3
            ( -0.02 0.0 0.02 )  //HF4
            ( -0.02 0.0 -0.02 ) //HF5
        );
        fields    (Qr Qin);
    }

    thermoCouple
    {
        type            thermoCoupleProbes;

        functionObjectLibs      ("libutilityFunctionObjects.so");
        writeControl           timeStep;
        writeInterval          100;

        solver          Euler;
        absTol          1e-4;
        relTol          1e-1;

        interpolationScheme cell;

        // thermocouple properties
        rho             8908;
        Cp              440;
        d               1e-3;
        epsilon         0.9;

        radName         G;

        probeLocations
        (
            (-0.18 0.02 0.0)   // 0.02m    [TC11]
            (-0.18 0.1 0.0)    // 0.1m     [TC9]
            (-0.18 0.3 0.0)    // 0.3m     [TC?]
            (-0.18 0.38 0.0)   // 0.39m    [TC2]

            (0 0.38 0.0)       // 0.38m    [TC17]
            (0 0.26 0.0)       // 0.26m    [TC18]
            (0.01 0.14 0.0)    // 0.14m    [TC19]


            (-0.2 0.015 0.0)   // 0.015m   [TC12]
            (-0.2 0.0385 0.0)  // 0.0385m  [TC1]

            (0.18 0.02 0.0)    // 0.02m    [TC16]
            (0.18 0.14 0.0)    // 0.14m    [TC15]
            (0.18 0.26 0.0)    // 0.26m    [TC14]
            (0.18 0.38 0.0)    // 0.38m    [TC13]
        );
        fields  (T);
    }

    probes_O2
    {
        type                probes;
        functionObjectLibs ("libsampling.so");
        writeControl       outputTime;
        writeInterval      30;
        probeLocations
        (
            (-0.1 0.02 0.0)    //lower Gas
            (-0.1 0.38 0.0)    //Upper Gas
        );
        fields  (O2);

    }
}

// ************************************************************************* //
